Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: A common purpose for an extension is to integrate a non-CDI aware service into the CDI based Quarkus runtime. Step 1 of this task is to load any configuration needed in a STATIC_INIT build step as we did in <<Parsing Config to Objects>>. Now we need to create an instance of the service using the configuration. Let's return to the `TestProcessor#parseServiceXmlConfig` method to see how this can be done.
ja_jp: エクステンションの一般的な目的は、CDI 以外の認識サービスを CDI ベースの Quarkus ランタイムに統合することです。このタスクの最初のステップは、<<コンフィグをオブジェクトにパースする>> で実行したように、STATIC_INIT ビルドステップで必要な設定をロードすることです。次に、設定を使用してサービスのインスタンスを作成する必要があります。 `TestProcessor#parseServiceXmlConfig` メソッドに戻って、これを行う方法を確認しましょう。

source: A common solution is to update your `docker-compose` file to use a private IPv4 address, such as `localhost`. For example:
ja_jp: 一般的な解決策は、`docker-compose` ファイルを更新して `localhost` のようなプライベート IPv4 アドレスを使用することです。例えば:

source: A completion stage (second leg) of the authorization code flow requires Quarkus OIDC to exchange the authorizaion code for ID, access and refresh tokens.
ja_jp: 認可コードフローの完了段階 (第 2 段階) では、Quarkus OIDC が認可コードを ID、アクセス、およびリフレッシュトークンと交換する必要があります。

source: A complex JSON structure that cannot be expressed with configuration properties in the `quarkus.oidc.authentication.rar` configuration namespace can be added with the `OidcRedirectFilter`. For example:
ja_jp: `quarkus.oidc.authentication.rar` 設定ネームスペースの設定プロパティーでは表現できない複雑な JSON 構造は、`OidcRedirectFilter` で追加できます。例:

source: A complex object type uses the following rules to map configuration values to their member values:
ja_jp: 複雑なオブジェクト型は、以下のルールを使用して設定値をメンバーの値にマッピングします。

source: A component that should be notified of any failure occurring in a background process (mainly index operations).
ja_jp: バックグラウンドプロセスで発生した障害が通知されるコンポーネント (主にインデックス操作)。

source: A component used to configure full text analysis (e.g. analyzers, normalizers).
ja_jp: フルテキスト分析 (アナライザー、ノーマライザーなど) を設定するために使用されるコンポーネント。

source: A component used to configure how to synchronize between application threads and indexing.
ja_jp: アプリケーションスレッドとインデックスの作成を同期する方法を設定するために使用されるコンポーネント。

source: A component used to configure the Elasticsearch layout: index names, index aliases, ...
ja_jp: Elasticsearch レイアウト (インデックス名、インデックスエイリアスなど) を設定するために使用されるコンポーネント。

source: A component used to configure the Hibernate Search mapping, in particular programmatically.
ja_jp: 特にプログラムによって Hibernate Search マッピングを設定するために使用されるコンポーネント。

source: A conditional dependency is a dependency that is activated only if a certain condition is satisfied. If the condition is not satisfied then the dependency **will not** be activated. In that regard, conditional dependencies can be categorized as optional, meaning they may or may not appear in the resulting dependency graph.
ja_jp: 条件付き依存関係は、特定の条件が満たされた場合にのみアクティブになる依存関係です。条件が満たされない場合、依存関係はアクティブになりません。この点で、条件付き依存関係はオプションとして分類できます。つまり、結果の依存関係グラフに表示されるかどうかはわかりません。

source: A conditional dependency is configured in the runtime artifact of a Quarkus extension. In our example, it's the `quarkus-extension-a` that has a conditional dependency on `quarkus-extension-b`, which can be expressed in two ways.
ja_jp: 条件付きの依存関係は、Quarkusエクステンションのランタイムアーティファクトで設定されます。この例では、 `quarkus-extension-b` に対する条件付き依存関係を持つ `quarkus-extension-a` であり、2つの方法で表現することができます。

source: A conditional dependency is configured in the runtime artifact of a Quarkus extension. In this example, the `quarkus-extension-a` will declare a conditional dependency on the `quarkus-extension-b`, which can be done in the following two ways.
ja_jp: 条件付き依存関係は、Quarkus エクステンションのランタイムアーティファクトで設定されます。この例では、 `quarkus-extension-a` は `quarkus-extension-b` に対する条件付き依存関係を宣言します。これは、次の 2 つの方法で実行できます。

source: A config mapping class support automatic conversions of all types available for conversion in `Config`:
ja_jp: 設定マッピングクラスは、 `Config` で変換可能なすべてのタイプの自動変換をサポートしています。

source: A config mapping interface can be injected into any CDI aware bean:
ja_jp: 設定マッピングインタフェースは，任意のCDI対応Beanに注入することができます。

source: A config mapping is also able to map a `Map`:
ja_jp: また、設定マッピングは、 `Map` をマッピングすることができます。

source: A config mapping is also able to map collections types `List` and `Set`:
ja_jp: また、設定マッピングは、コレクションタイプ `List` と `Set` をマッピングすることができます。

source: A config mapping may combine annotations from https://beanvalidation.org[Bean Validation] to validate configuration values:
ja_jp: 設定マッピングは、設定値を検証するために link:https://beanvalidation.org[Bean Validation]からのアノテーションを組み合わせることができます。

source: A config mapping requires a public interface with minimal metadata configuration and annotated with the `@io.smallrye.config.ConfigMapping` annotation.
ja_jp: 設定マッピングでは、最小限のメタデータ構成で、 `@io.smallrye.config.ConfigMapping` のアノテーションが付いたパブリックインターフェイスが必要です。

source: A config mapping requires an interface with minimal metadata configuration and annotated with the `@io.smallrye.config.ConfigMapping` annotation.
ja_jp: 設定マッピングでは、最小メタデータ設定で、 `@io.smallrye.config.ConfigMapping` のアノテーションが付いたインターフェースが必要です。

source: A config value which contains unescaped commas may be converted to `Collection`. This works for simple cases, but it becomes cumbersome and limited for more advanced cases.
ja_jp: エスケープされていないコンマを含む設定値は、 `Collection` に変換できます。これは単純なケースでは機能しますが、面倒になり、より高度なケースでは制限されます。

source: A configuration item can be marked to have a default value. The default value is used when no matching configuration key is specified in the configuration.
ja_jp: 設定アイテムは、デフォルト値を持つようにマークすることができます。設定で一致する設定キーが指定されていない場合は、デフォルト値が使用されます。

source: A configuration mapping name can contain an extra suffix segment for the case where there are configuration mappings for multiple <<Config Phases>>. Classes which correspond to the `BUILD_TIME` and `BUILD_AND_RUN_TIME_FIXED` may end with `BuildTimeConfig` or `BuildTimeConfiguration`, classes which correspond to the `RUN_TIME` phase may end with `RuntimeConfig`, `RunTimeConfig`, `RuntimeConfiguration` or `RunTimeConfiguration` while classes which correspond to the `BOOTSTRAP` configuration may end with `BootstrapConfig` or `BootstrapConfiguration`.
ja_jp: 設定マッピング名には、複数の <<Config Phases>> に対する設定マッピングが存在する場合のために、追加のサフィックスセグメントを含めることができます。 `BUILD_TIME` と `BUILD_AND_RUN_TIME_FIXED` に対応するクラスは、 `BuildTimeConfig` または `BuildTimeConfiguration` で終わることがあります。 `RUN_TIME` フェーズに対応するクラスは、 `RuntimeConfig` 、 `RunTimeConfig` 、 `RuntimeConfiguration` または `RunTimeConfiguration` で終わることがあります。 `BOOTSTRAP` 設定に対応するクラスは `BootstrapConfig` または `BootstrapConfiguration` で終わることがあります。

source: A configuration mapping name can contain an extra suffix segment for the case where there are configuration mappings for multiple <<config-phases>>. Classes which correspond to the `BUILD_TIME` and `BUILD_AND_RUN_TIME_FIXED` may end with `BuildTimeConfig` or `BuildTimeConfiguration`, classes which correspond to the `RUN_TIME` phase may end with `RuntimeConfig`, `RunTimeConfig`, `RuntimeConfiguration` or `RunTimeConfiguration`.
ja_jp: 設定マッピング名には、複数の <<config-phases>> に対応する設定マッピングがある場合に備えて、 追加のサフィックスセグメントを含めることができます。 `BUILD_TIME` と `BUILD_AND_RUN_TIME_FIXED` に対応するクラスは、 `BuildTimeConfig` または `BuildTimeConfiguration`で終わる場合があり、 `RUN_TIME` フェーズに対応するクラスは、 `RuntimeConfig`、 `RunTimeConfig`、 `RuntimeConfiguration` または `RunTimeConfiguration` で終わる場合があります。

source: A configuration path is built by taking the object type prefix (or namespace) and the mapping member name
ja_jp: 設定パスは、オブジェクト型のプレフィックス (または名前空間) とマッピングメンバー名を取得して構築されます。

source: A configuration property name can be split into segments. For example, a property name like `quarkus.log.file.enable` can be split into the following segments:
ja_jp: 設定プロパティー名は、セグメントに分割できます。たとえば、 `quarkus.log.file.enable` のようなプロパティー名は、次のセグメントに分割できます。

source: A configuration property name can be split into segments. For example, a property name like `quarkus.log.file.enabled` can be split into the following segments:
ja_jp: 設定プロパティー名はセグメントに分割できます。例えば、 `quarkus.log.file.enabled` のようなプロパティー名は、以下のセグメントに分割できます。

source: A configuration root's class name can contain an extra suffix segment for the case where there are configuration roots for multiple <<Configuration Root Phases>>. Classes which correspond to the `BUILD_TIME` and `BUILD_AND_RUN_TIME_FIXED` may end with `BuildTimeConfig` or `BuildTimeConfiguration`, classes which correspond to the `RUN_TIME` phase may end with `RuntimeConfig`, `RunTimeConfig`, `RuntimeConfiguration` or `RunTimeConfiguration` while classes which correspond to the `BOOTSTRAP` configuration may end with `BootstrapConfig` or `BootstrapConfiguration`.
ja_jp: 複数の <<設定ルートフェーズ>> がある場合は、設定ルートのクラス名に追加の接尾辞セグメントを含めることができます。 `BUILD_TIME` と `BUILD_AND_RUN_TIME_FIXED` に対応するクラスは `BuildTimeConfig` または `BuildTimeConfiguration` で終わる場合があり、 `RUN_TIME` フェーズに対応するクラスは `RuntimeConfig`、 `RunTimeConfig`、 `RuntimeConfiguration`、または `RunTimeConfiguration` で終わる場合があります。一方、 `BOOTSTRAP` 設定に対応するクラスは、 `BootstrapConfig` または `BootstrapConfiguration` で終わる場合があります。

source: A configuration root's name can be given with the `name` property, or it can be inferred from the class name. If the latter, then the configuration key will be the class name, minus any `Config` or `Configuration` suffix, broken up by camel-case, lowercased, and re-joined using hyphens (`-`).
ja_jp: 設定ルートの名前は、 `name` プロパティーを使用して指定するか、クラス名から推測できます。後者の場合、設定キーはクラス名から `Config` または `Configuration` の接尾辞を除いたものを camel-case 区切り、小文字にし、ハイフン (`-`) を使用して再結合したものになります。

source: A conflict between two definitions, e.g. mistakenly assigning both a value and specifying that a variable is derived from a field, will result in an error being thrown at build time so that you get the opportunity to fix the issue before you deploy your application to your cluster where it might be more difficult to diagnose the source of the issue.
ja_jp: 例えば、誤って両方の値を代入したり、変数がフィールドから派生したものであることを指定したりするなど、2つの定義の間で競合が発生すると、ビルド時にエラーが発生します。そのため、問題の原因を診断するのが困難なクラスターにアプリケーションをデプロイする前に問題を修正する機会を得ることができます。

source: A conflict between two definitions, for example, mistakenly assigning both a value and specifying that a variable is derived from a field, results in an error being thrown at build time. You can fix the issue before you deploy your application to your cluster, where it might be more difficult to diagnose the source of the issue.
ja_jp: 2つの定義が衝突した場合、たとえば、値を誤って代入したり、変数がフィールドから派生していることを指定したりすると、ビルド時にエラーがスローされます。クラスタにアプリケーションをデプロイする前に問題を修正することができます。

source: A connector can be used to configure and open a new client connection backed by a client endpoint that is used to consume and send messages. Quarkus provides a CDI bean with bean type `io.quarkus.websockets.next.WebSocketConnector<CLIENT>` and default qualifer that can be injected in other beans. The actual type argument of an injection point is used to determine the client endpoint. The type is validated during build - if it does not represent a client endpoint the build fails.
ja_jp: コネクターを使用すると、メッセージの消費と送信に使用されるクライアントエンドポイントによってサポートされる新しいクライアント接続を設定して開くことができます。 Quarkus は、Bean タイプ `io.quarkus.websockets.next.WebSocketConnector<CLIENT>` の CDI Bean および他の Bean に注入できるデフォルトの修飾子を提供します。 注入ポイントの実際のタイプ引数は、クライアントエンドポイントを決定するために使用されます。 このタイプはビルド時に検証され、クライアントエンドポイントを表していない場合、ビルドは失敗します。

source: A containerised version of your external service (not all Dev Services rely on containers, but most do)
ja_jp: 外部サービスのコンテナ化バージョン（すべてのDev Serviceがコンテナに依存しているわけではありませんが、ほとんどのDev Serviceはコンテナに依存しています。）

source: A context object to access the current request
ja_jp: 現在のリクエストにアクセスするためのコンテキストオブジェクト

source: A context object to access the current response
ja_jp: 現在のレスポンスにアクセスするためのコンテキストオブジェクト

source: A contributor started working on a JDBC driver extension for SQLite and we improved the infrastructure for external JDBC driver extensions.
ja_jp: あるコントリビューターが SQLite 用の JDBC ドライバエクステンションに取り組み始め、私たちは外部の JDBC ドライバエクステンションのためのインフラを改善しました。

source: A convenience feature that allows you to control most of the above features from a single build item.
ja_jp: 上記の機能のほとんどを単一のビルドアイテムから制御できる便利な機能。

source: A convenient way to tell Quarkus that the extension requires SSL and it should be enabled during native image build. When using this feature, remember to add your extension to the list of extensions that offer SSL support automatically on the https://github.com/quarkusio/quarkus/blob/main/docs/src/main/asciidoc/native-and-ssl.adoc[native and ssl guide].
ja_jp: エクステンションにSSLが必要であり、ネイティブイメージのビルド時に有効にする必要があることをQuarkusに伝える便利な方法です。 この機能を使用する場合は、 link:https://github.com/quarkusio/quarkus/blob/main/docs/src/main/asciidoc/native-and-ssl.adoc[ネイティブとSSLのガイド] で、SSLサポートを自動的に提供するエクステンションのリストにエクステンションを追加することを忘れないでください。

source: A convenient way to tell Quarkus that the extension requires SSL, and it should be enabled during native image build. When using this feature, remember to add your extension to the list of extensions that offer SSL support automatically on the https://github.com/quarkusio/quarkus/blob/main/docs/src/main/asciidoc/native-and-ssl.adoc[native and ssl guide].
ja_jp: エクステンションがSSLを必要とし、ネイティブイメージのビルド中に有効にする必要があることをQuarkusに伝える便利な方法です。この機能を使用する場合は、 link:https://github.com/quarkusio/quarkus/blob/main/docs/src/main/asciidoc/native-and-ssl.adoc[ネイティブおよびSSLガイド] の、自動的にSSLサポートを提供するエクステンションのリストに、作成したエクステンションを追加することを忘れないでください。

source: A core part of the authentication process is ensuring the chain of trust and validity of the information. This is done by ensuring tokens can be trusted.
ja_jp: 認証プロセスの中核となるのは、トラストチェーンと情報の有効性を確認することです。 これは、トークンが信頼できることを確認することによって行われます。

source: A corresponding `application.properties` for the above example could be:
ja_jp: 上記の例に対応する `application.properties` は次のようになります。

source: A couple good examples of how Quarkus uses this strategy to support both RESTEasy flavors in the core repository can be seen [here](https://github.com/quarkusio/quarkus/pull/21089) and [here](https://github.com/quarkusio/quarkus/pull/20874).
ja_jp: Quarkusがこの戦略を用いて、コアリポジトリでRESTEasyの両方のフレーバーをサポートしている好例は、 [こちら](https://github.com/quarkusio/quarkus/pull/21089) と [こちら] (https://github.com/quarkusio/quarkus/pull/20874) にあります。

source: A couple good examples of how Quarkus uses this strategy to support both RESTEasy flavors in the core repository can be seen https://github.com/quarkusio/quarkus/pull/21089[here] and https://github.com/quarkusio/quarkus/pull/20874[here].
ja_jp: Quarkusがこの戦略を用いて、コアリポジトリでRESTEasyの両方のフレーバーをサポートしている適切な例が https://github.com/quarkusio/quarkus/pull/21089[こちら] と https://github.com/quarkusio/quarkus/pull/20874[こちら] で確認できます。

source: A credential provider offers a way to retrieve the keystore and alias password. Note that the credential provider is only used if the password or alias password is not set in the configuration.
ja_jp: 認証情報プロバイダーは、キーストアとエイリアスのパスワードを取得する方法として機能します。 認証情報プロバイダーは、設定でパスワードまたはエイリアスパスワードが設定されていない場合にのみ使用されることに注意してください。

source: A credential provider offers a way to retrieve the keystore and alias password. Quarkus uses the credential provider only when the configuration does not set the keystore password or alias password.
ja_jp: 認証情報プロバイダーは、キーストアとエイリアスのパスワードを取得する方法を提供します。Quarkus は、設定でキーストアパスワードまたはエイリアスパスワードが設定されていない場合にのみ、認証情報プロバイダーを使用します。

source: A critical service failure or complete inability to service requests of any kind.
ja_jp: 致命的なサービス障害、またはあらゆる種類のリクエストに対応できないこと。

source: A critical service failure or total inability to handle any requests.
ja_jp: 重大なサービス障害またはリクエストをまったく処理できない状態。

source: A critical service failure/complete inability to service requests of any kind.
ja_jp: 致命的なサービス障害/いかなる種類のサービス要求にも完全に対応できないこと

source: A custom `ConfigSource` is not automatically added during Quarkus _STATIC INIT_. It requires to be marked with the `@io.quarkus.runtime.configuration.StaticInitSafe` annotation.
ja_jp: カスタム `ConfigSource` は、Quarkusの _STATIC INIT_ 中に自動的に追加されません。 `@io.quarkus.runtime.configuration.StaticInitSafe` のアノテーションを付ける必要があります。

source: A custom `ConfigSource` requires an implementation of `org.eclipse.microprofile.config.spi.ConfigSource` or `org.eclipse.microprofile.config.spi.ConfigSourceProvider`. Each implementation requires registration via the https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader] mechanism, either in `META-INF/services/org.eclipse.microprofile.config.spi.ConfigSource` or `META-INF/services/org.eclipse.microprofile.config.spi.ConfigSourceProvider` files.
ja_jp: カスタム `ConfigSource` には、 `org.eclipse.microprofile.config.spi.ConfigSource` または `org.eclipse.microprofile.config.spi.ConfigSourceProvider` の実装が必要です。それぞれの実装は、 link:https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader]メカニズムを介して、 `META-INF/services/org.eclipse.microprofile.config.spi.ConfigSource` または `META-INF/services/org.eclipse.microprofile.config.spi.ConfigSourceProvider` のファイルで登録する必要があります。

source: A custom `ConfigSource` requires an implementation of `org.eclipse.microprofile.config.spi.ConfigSource` or `org.eclipse.microprofile.config.spi.ConfigSourceProvider`. Each implementation requires registration via the https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader] mechanism, either in `META-INF/services/org.eclipse.microprofile.config.spi.ConfigSource` or `META-INF/services/org.eclipse.microprofile.config.spi.ConfigSourceProvider` files.
ja_jp: カスタム `ConfigSource` には、 `org.eclipse.microprofile.config.spi.ConfigSource` または `org.eclipse.microprofile.config.spi.ConfigSourceProvider` の実装が必要です。 各実装には、 `META-INF/services/org.eclipse.microprofile.config.spi.ConfigSource` または `META-INF/services/org.eclipse.microprofile.config.spi.ConfigSourceProvider` ファイルの link:https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader] メカニズムによる登録が必要です。

source: A custom `Converter` requires an implementation of `org.eclipse.microprofile.config.spi.Converter<T>`. Each implementation requires registration via the https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader] mechanism in the `META-INF/services/org.eclipse.microprofile.config.spi.Converter` file. Consider:
ja_jp: カスタム `Converter` には、 `org.eclipse.microprofile.config.spi.Converter<T>` の実装が必要です。それぞれの実装は、 `META-INF/services/org.eclipse.microprofile.config.spi.Converter` ファイルの link:https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader]メカニズムによる登録が必要です。以下だとすると、

source: A custom `Converter` requires an implementation of `org.eclipse.microprofile.config.spi.Converter<T>`. Each implementation requires registration via the https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader] mechanism in the `META-INF/services/org.eclipse.microprofile.config.spi.Converter` file. Consider:
ja_jp: カスタム `Converter` には、 `org.eclipse.microprofile.config.spi.Converter<T>` の実装が必要です。 各実装には、 `META-INF/services/org.eclipse.microprofile.config.spi.Converter` ファイル内の link:https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/util/ServiceLoader.html[ServiceLoader] メカニズムを介した登録が必要です。以下の場合、

source: A custom `OidcRedirectFilter` for local error and session-expired pages can also create secure cookies to help generate these pages.
ja_jp: ローカルエラーおよびセッション期限切れページ用のカスタム `OidcRedirectFilter` により、そのようなページの生成に役立つセキュアな Cookie を作成することもできます。

source: A custom `TemplateInstance.Initializer` can be registered with `EngineBuilder#addTemplateInstanceInitializer()` and initialize a template instance with any data and attributes.
ja_jp: カスタム `TemplateInstance.Initializer` は、`EngineBuilder#addTemplateInstanceInitializer()` を使用して登録でき、任意のデータと属性を使用してテンプレートインスタンスを初期化できます。

source: A custom `bootstrap` script
ja_jp: カスタム `bootstrap` スクリプト

source: A custom `io.quarkus.oidc.TokenStateManager` implementation that does not want tokens encrypted by default can disable it with `quarkus.oidc.token-state-manager.encryption-required=false`.
ja_jp: デフォルトでのトークンの暗号化を望まないカスタムの `io.quarkus.oidc.TokenStateManager` 実装では、`quarkus.oidc.token-state-manager.encryption-required=false` で暗号化を無効にできます。

source: A custom `io.quarkus.qute.ValueResolver` can be registered programmatically via `EngineBuilder.addValueResolver()`.
ja_jp: カスタム `io.quarkus.qute.ValueResolver` は、`EngineBuilder.addValueResolver()` を介してプログラムで登録できます。

source: A custom driver definition example with the legacy OpenTracing driver:
ja_jp: レガシー OpenTracing ドライバーを使用したカスタムドライバ定義の例:

source: A custom image name can be configured as such:
ja_jp: カスタムイメージ名は次のように設定できます。

source: A custom value resolver can be easily built via `ValueResolver.builder()`
ja_jp: `ValueResolver.builder()` を経由して、簡単にカスタム値リゾルバを構築することができます。

source: A datasource can be JDBC, reactive, or both. This depends on the configuration and the selection of project extensions.
ja_jp: データソースは JDBC、リアクティブ、またはその両方の可能性があります。 これは、設定とプロジェクトエクステンションの選択に依存します。

source: A datasource can be either a JDBC datasource, a reactive one or both. It all depends on how you configure it and which extensions you added to your project.
ja_jp: データソースは、JDBC データソースまたはリアクティブデータソースのいずれか 1 つでも、その両方でも構いません。データソースの設定方法と、プロジェクトに追加したエクステンションによって異なります。

source: A datasource can be either a JDBC datasource, reactive, or both. This depends on the configuration and the selection of project extensions.
ja_jp: データソースには、JDBC データソース、リアクティブ、またはその両方を指定できます。 これは、設定とプロジェクトエクステンションの選択に依存します。

source: A datasource named `inventory`,
ja_jp: `inventory` という名前のデータソース。

source: A datasource named `users`,
ja_jp: `users` という名前のデータソース。

source: A dead letter routing key to assign to the queue; if not supplied will default to the queue name Type: _string_
ja_jp: キューに割り当てるデッドレタールーティングキー。指定しない場合、デフォルトでキュー名になります。 Type: _string_

source: A default (global) proxy
ja_jp: デフォルト (グローバル) プロキシー

source: A default value demonstration. The required role is denoted by the value of the `customer` property. However, if that property is not specified, a role named `User` is required as a default.
ja_jp: デフォルト値のデモンストレーション。 必要なロールは、 `customer` プロパティーの値によって示されます。 ただし、そのプロパティーが指定されていない場合は、デフォルトで `User` という名前のロールが必要になります。

source: A default value demonstration. The required role will be denoted by the value of the `customer` property, but if that property is not specified, a role named `User` will be required as a default.
ja_jp: デフォルト値の実証。 必要な役割は `customer` プロパティの値で示されますが、そのプロパティが指定されていない場合、 `User` という名前のロールがデフォルトとして要求されます。

source: A demo and a lot more!
ja_jp: デモや、更に沢山！

source: A dependency with a Jandex index is automatically scanned for beans. To generate the index just add the following plugin to your build file:
ja_jp: Jandex インデックスを持つ依存関係は、Bean に対して自動的にスキャンされます。インデックスを生成するには、次のプラグインをビルドファイルに追加するだけです。

source: A dependency with a Jandex index is automatically scanned for beans. To generate the index just add the following to your `pom.xml`:
ja_jp: Jandex インデックスを持つ依存関係は、自動的に Bean をスキャンします。インデックスを生成するには、以下を `pom.xml` に追加してください。

source: A dependency with a Jandex index is automatically scanned for beans. To generate the index, just add the following plugin to your build file:
ja_jp: Jandex インデックスを持つ依存関係は、Bean に対して自動的にスキャンされます。インデックスを生成するには、ビルドファイルに次のプラグインを追加するだけです。

source: A deployment time submodule that handles the build time processing and bytecode recording.
ja_jp: ビルド時の処理やバイトコードの記録を行うデプロイメント時サブモジュール

source: A description of OpenShift resources and customisable properties is given below alongside Kubernetes resources to show similarities where applicable. This includes an alternative to `oc new-app ...` above, i.e. `oc apply -f target/kubernetes/openshift.json` .
ja_jp: OpenShift リソースとカスタマイズ可能なプロパティーの説明を、適宜 Kubernetes リソースと並べて以下に示します。これには、上記の `oc new-app ...` の代替手段、つまり `oc apply -f target/kubernetes/openshift.json` も含まれます。

source: A detailed documentation is available in the link:/guides/resteasy-reactive[RESTEasy Reactive guide].
ja_jp: 詳細なドキュメントは、 link:/guides/resteasy-reactive[RESTEasy Reactiveガイド] にございます。
